RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_dma.c
/**
  * @brief  Checks whether the specified DMAy Channelx interrupt has occurred or not.
  * @param  DMAy_INT: specifies the DMAy interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg DMA1_INT_GL1: DMA1 Channel1 global interrupt.
  *     @arg DMA1_INT_TC1: DMA1 Channel1 transfer complete interrupt.
  *     @arg DMA1_INT_HT1: DMA1 Channel1 half transfer interrupt.
  *     @arg DMA1_INT_ERR1: DMA1 Channel1 transfer error interrupt.
  *     @arg DMA1_INT_GL2: DMA1 Channel2 global interrupt.
  *     @arg DMA1_INT_TC2: DMA1 Channel2 transfer complete interrupt.
  *     @arg DMA1_INT_HT2: DMA1 Channel2 half transfer interrupt.
  *     @arg DMA1_INT_ERR2: DMA1 Channel2 transfer error interrupt.
  *     @arg DMA1_INT_GL3: DMA1 Channel3 global interrupt.
  *     @arg DMA1_INT_TC3: DMA1 Channel3 transfer complete interrupt.
  *     @arg DMA1_INT_HT3: DMA1 Channel3 half transfer interrupt.
  *     @arg DMA1_INT_ERR3: DMA1 Channel3 transfer error interrupt.
  *     @arg DMA1_INT_GL4: DMA1 Channel4 global interrupt.
  *     @arg DMA1_INT_TC4: DMA1 Channel4 transfer complete interrupt.
  *     @arg DMA1_INT_HT4: DMA1 Channel4 half transfer interrupt.
  *     @arg DMA1_INT_ERR4: DMA1 Channel4 transfer error interrupt.
  *     @arg DMA1_INT_GL5: DMA1 Channel5 global interrupt.
  *     @arg DMA1_INT_TC5: DMA1 Channel5 transfer complete interrupt.
  *     @arg DMA1_INT_HT5: DMA1 Channel5 half transfer interrupt.
  *     @arg DMA1_INT_ERR5: DMA1 Channel5 transfer error interrupt.
  *     @arg DMA1_INT_GL6: DMA1 Channel6 global interrupt.
  *     @arg DMA1_INT_TC6: DMA1 Channel6 transfer complete interrupt.
  *     @arg DMA1_INT_HT6: DMA1 Channel6 half transfer interrupt.
  *     @arg DMA1_INT_ERR6: DMA1 Channel6 transfer error interrupt.
  *     @arg DMA1_INT_GL7: DMA1 Channel7 global interrupt.
  *     @arg DMA1_INT_TC7: DMA1 Channel7 transfer complete interrupt.
  *     @arg DMA1_INT_HT7: DMA1 Channel7 half transfer interrupt.
  *     @arg DMA1_INT_ERR7: DMA1 Channel7 transfer error interrupt.
  *     @arg DMA2_INT_GL1: DMA2 Channel1 global interrupt.
  *     @arg DMA2_INT_TC1: DMA2 Channel1 transfer complete interrupt.
  *     @arg DMA2_INT_HT1: DMA2 Channel1 half transfer interrupt.
  *     @arg DMA2_INT_ERR1: DMA2 Channel1 transfer error interrupt.
  *     @arg DMA2_INT_GL2: DMA2 Channel2 global interrupt.
  *     @arg DMA2_INT_TC2: DMA2 Channel2 transfer complete interrupt.
  *     @arg DMA2_INT_HT2: DMA2 Channel2 half transfer interrupt.
  *     @arg DMA2_INT_ERR2: DMA2 Channel2 transfer error interrupt.
  *     @arg DMA2_INT_GL3: DMA2 Channel3 global interrupt.
  *     @arg DMA2_INT_TC3: DMA2 Channel3 transfer complete interrupt.
  *     @arg DMA2_INT_HT3: DMA2 Channel3 half transfer interrupt.
  *     @arg DMA2_INT_ERR3: DMA2 Channel3 transfer error interrupt.
  *     @arg DMA2_INT_GL4: DMA2 Channel4 global interrupt.
  *     @arg DMA2_INT_TC4: DMA2 Channel4 transfer complete interrupt.
  *     @arg DMA2_INT_HT4: DMA2 Channel4 half transfer interrupt.
  *     @arg DMA2_INT_ERR4: DMA2 Channel4 transfer error interrupt.
  *     @arg DMA2_INT_GL5: DMA2 Channel5 global interrupt.
  *     @arg DMA2_INT_TC5: DMA2 Channel5 transfer complete interrupt.
  *     @arg DMA2_INT_HT5: DMA2 Channel5 half transfer interrupt.
  *     @arg DMA2_INT_ERR5: DMA2 Channel5 transfer error interrupt.
  * @retval The new state of DMAy_INT (SET or RESET).
  */
ITStatus DMA_GetITStatus(uint32_t DMAy_INT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_DMA_GET_INT(DMAy_INT));

  /* Calculate the used DMA */
  if ((DMAy_INT & FLAG_Mask) != (uint32_t)RESET)
  {
    /* Get DMA2 ISR register value */
    tmpreg = DMA2->ISTS;
  }
  else
  {
    /* Get DMA1 ISR register value */
    tmpreg = DMA1->ISTS;
  }

  /* Check the status of the specified DMAy interrupt */
  if ((tmpreg & DMAy_INT) != (uint32_t)RESET)
  {
    /* DMAy_INT is set */
    bitstatus = SET;
  }
  else
  {
    /* DMAy_INT is reset */
    bitstatus = RESET;
  }

  /* Return the DMA_INT status */
  return  bitstatus;
}

/**
  * @brief  Clears the DMAy Channelx's interrupt pending bits.
  * @param  DMAy_INT: specifies the DMAy interrupt pending bit to clear.
  *   This parameter can be any combination (for the same DMA) of the following values:
  *     @arg DMA1_INT_GL1: DMA1 Channel1 global interrupt.
  *     @arg DMA1_INT_TC1: DMA1 Channel1 transfer complete interrupt.
  *     @arg DMA1_INT_HT1: DMA1 Channel1 half transfer interrupt.
  *     @arg DMA1_INT_ERR1: DMA1 Channel1 transfer error interrupt.
  *     @arg DMA1_INT_GL2: DMA1 Channel2 global interrupt.
  *     @arg DMA1_INT_TC2: DMA1 Channel2 transfer complete interrupt.
  *     @arg DMA1_INT_HT2: DMA1 Channel2 half transfer interrupt.
  *     @arg DMA1_INT_ERR2: DMA1 Channel2 transfer error interrupt.
  *     @arg DMA1_INT_GL3: DMA1 Channel3 global interrupt.
  *     @arg DMA1_INT_TC3: DMA1 Channel3 transfer complete interrupt.
  *     @arg DMA1_INT_HT3: DMA1 Channel3 half transfer interrupt.
  *     @arg DMA1_INT_ERR3: DMA1 Channel3 transfer error interrupt.
  *     @arg DMA1_INT_GL4: DMA1 Channel4 global interrupt.
  *     @arg DMA1_INT_TC4: DMA1 Channel4 transfer complete interrupt.
  *     @arg DMA1_INT_HT4: DMA1 Channel4 half transfer interrupt.
  *     @arg DMA1_INT_ERR4: DMA1 Channel4 transfer error interrupt.
  *     @arg DMA1_INT_GL5: DMA1 Channel5 global interrupt.
  *     @arg DMA1_INT_TC5: DMA1 Channel5 transfer complete interrupt.
  *     @arg DMA1_INT_HT5: DMA1 Channel5 half transfer interrupt.
  *     @arg DMA1_INT_ERR5: DMA1 Channel5 transfer error interrupt.
  *     @arg DMA1_INT_GL6: DMA1 Channel6 global interrupt.
  *     @arg DMA1_INT_TC6: DMA1 Channel6 transfer complete interrupt.
  *     @arg DMA1_INT_HT6: DMA1 Channel6 half transfer interrupt.
  *     @arg DMA1_INT_ERR6: DMA1 Channel6 transfer error interrupt.
  *     @arg DMA1_INT_GL7: DMA1 Channel7 global interrupt.
  *     @arg DMA1_INT_TC7: DMA1 Channel7 transfer complete interrupt.
  *     @arg DMA1_INT_HT7: DMA1 Channel7 half transfer interrupt.
  *     @arg DMA1_INT_ERR7: DMA1 Channel7 transfer error interrupt.
  *     @arg DMA2_INT_GL1: DMA2 Channel1 global interrupt.
  *     @arg DMA2_INT_TC1: DMA2 Channel1 transfer complete interrupt.
  *     @arg DMA2_INT_HT1: DMA2 Channel1 half transfer interrupt.
  *     @arg DMA2_INT_ERR1: DMA2 Channel1 transfer error interrupt.
  *     @arg DMA2_INT_GL2: DMA2 Channel2 global interrupt.
  *     @arg DMA2_INT_TC2: DMA2 Channel2 transfer complete interrupt.
  *     @arg DMA2_INT_HT2: DMA2 Channel2 half transfer interrupt.
  *     @arg DMA2_INT_ERR2: DMA2 Channel2 transfer error interrupt.
  *     @arg DMA2_INT_GL3: DMA2 Channel3 global interrupt.
  *     @arg DMA2_INT_TC3: DMA2 Channel3 transfer complete interrupt.
  *     @arg DMA2_INT_HT3: DMA2 Channel3 half transfer interrupt.
  *     @arg DMA2_INT_ERR3: DMA2 Channel3 transfer error interrupt.
  *     @arg DMA2_INT_GL4: DMA2 Channel4 global interrupt.
  *     @arg DMA2_INT_TC4: DMA2 Channel4 transfer complete interrupt.
  *     @arg DMA2_INT_HT4: DMA2 Channel4 half transfer interrupt.
  *     @arg DMA2_INT_ERR4: DMA2 Channel4 transfer error interrupt.
  *     @arg DMA2_INT_GL5: DMA2 Channel5 global interrupt.
  *     @arg DMA2_INT_TC5: DMA2 Channel5 transfer complete interrupt.
  *     @arg DMA2_INT_HT5: DMA2 Channel5 half transfer interrupt.
  *     @arg DMA2_INT_ERR5: DMA2 Channel5 transfer error interrupt.
  * @retval None
  */
void DMA_ClearITPendingBit(uint32_t DMAy_INT)
{
  /* Check the parameters */
  assert_param(IS_DMA_CLEAR_INT(DMAy_INT));

  /* Calculate the used DMAy */
  if ((DMAy_INT & FLAG_Mask) != (uint32_t)RESET)
  {
    /* Clear the selected DMAy interrupt pending bits */
    DMA2->ICLR = DMAy_INT;
  }
  else
  {
    /* Clear the selected DMAy interrupt pending bits */
    DMA1->ICLR = DMAy_INT;
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


